Community-PIO-CH32V/ArduinoCore-CH32H4/libraries/lwIP_Ethernet/src/ch32h4_eth.c
/* Only built when the board asks for networking. This file lives in cores/,
 * so without the guard it would compile for every sketch -- including ones
 * built without lwIP on the include path. */
/* This file used to be wrapped in an ifdef on a build define, because it
   lived in cores/ch32h4 and was compiled into every sketch whether or not it
   had a network. It lives in libraries/lwIP_Ethernet now, so it is compiled
   only for sketches that included LwipEthernet -- which is what the guard was
   simulating, done by the build system instead of the preprocessor. */

#include <errno.h>

/* The name this interface gives DHCP. Not const: eth_set_hostname() replaces
 * the pointer, and lwIP only stores it. */
const char *ch32h4_eth_hostname = "ch32h417";
/* Ethernet MAC and on-chip 100M PHY, bridged to lwip.
 *
 * The MAC is a Synopsys DWMAC -- the same IP STM32F4/F7 carry -- so the
 * register names, the 4-word chained descriptors and the overall shape of this
 * driver match ports/stm32/eth.c. What follows documents only where the CH32
 * differs, because those are the parts no STM32 reference will tell you.
 *
 * WCH's own driver for this part is EVT/EXAM/ETH/NetLib/eth_driver_100M.c,
 * paired with a precompiled libwchnet.a. The library is lwip with WCH's socket
 * API on top; MicroPython already vendors lwip, so only the hardware knowledge
 * below is taken from it. See docs/superpowers/specs/2026-08-12-ch32-ethernet-design.md.
 *
 * Four CH32-specific facts drive this file:
 *
 * 1. The PHY is ON-CHIP. Its MDI pins go straight to the RJ45 and reference
 *    manual table 31-1 lists them as "No IO configuration required" -- there is
 *    no RMII pin muxing to do, unlike every STM32 board. It answers on SMI
 *    address 1.
 * 2. It needs its own PLL: RCC_CTLR bit 26 ETH_PLLON, ready on bit 27.
 * 3. It is held in reset and powered down out of cold boot, by MACPHYCR
 *    bits 31 and 30.
 * 4. There is an undocumented analog trim that must be reapplied on every
 *    link-up. See eth_phy_para_cfg().
 */

#include <string.h>

#include "Arduino.h"
#include "ch32h4_fault.h"
#include "ch32h4_irq.h"

#include "ch32h417.h"
#include "ch32h4_eth.h"


#include "lwip/dhcp.h"
#include "lwip/etharp.h"
#include "lwip/init.h"
#include "lwip/netif.h"
#include "netif/ethernet.h"


/* On-chip PHY's SMI address. Fixed in silicon, not a board choice. */
#define PHY_ADDRESS (1)

/* MACPHYCR. Both of these are CH32 extensions to the DWMAC register file and
 * appear in no STM32 documentation. Out of reset the on-chip PHY is powered
 * down AND held in reset, so both must be touched before SMI reads return
 * anything but 0xffff. */
#define MACPHYCR_PHY_POWERDOWN (1u << 30)  // 1 = powered down
#define MACPHYCR_PHY_RESET_N   (1u << 31)  // 1 = out of reset

/* RCC_CTLR. The Ethernet block runs from its own 500 MHz PLL. */
#define RCC_CTLR_ETH_PLLON  (1u << 26)
#define RCC_CTLR_ETH_PLLRDY (1u << 27)

/* RCC_HBPCENR bit 14: Ethernet MAC clock. */
#define RCC_HBPCENR_ETHMACEN (1u << 14)

/* Descriptor counts. WCH ship four of each.
 *
 * Receive gets more, because frames are not processed in the interrupt (see
 * eth_rx_process) -- the descriptors have to hold whatever arrives between two
 * visits to the background hook. At 100 Mbit a millisecond is 12.5 KB, about
 * eight maximum-size frames, so twelve leaves headroom for a hook that is late.
 * Transmit needs no such margin: eth_netif_output waits for a free descriptor
 * rather than deferring. */
#define ETH_RX_DESC_NUM (12)
#define ETH_TX_DESC_NUM (4)

/* PHY registers beyond the IEEE-standard set. This PHY is paged: PHY_PAG_SEL
 * selects which bank registers 0x10-0x1e refer to. Forgetting to set the page
 * back to 0 makes later standard-register reads return another page's data,
 * which is why every paged access here restores it. */
/* PHY_PAG_SEL, PHY_INTERRUPT_MASK and PHY_INTERRUPT_IND come from
 * ch32h417_eth.h; only what that header lacks is defined here. */
#define PHY_PAGE_0          (0x00)
#define PHY_PAGE_7          (0x07)
#define PHY_STATUS_REG      (0x1a)  // page 0: live speed/duplex
#define PHY_STATUS_100M     (1u << 3)
#define PHY_STATUS_FULLDUP  (1u << 1)
#define PHY_INTMASK_LINK_IE (1u << 13)
#define PHY_INTMASK_LED_ON  (1u << 9)

/* Factory MAC address, six bytes stored HIGH byte first and read downwards.
 * WCHNET_GetMacAddr() walks backwards from +5, so the natural forward read
 * gives the address reversed -- a detail worth stating because getting it
 * wrong produces a MAC that looks plausible and is not the one on the label. */
#define ROM_CFG_USERADR_ID (0x1ffff7e8)

typedef struct _eth_t {
    struct netif netif;
    bool active;
    bool link_up;
    volatile bool link_event;  // set by the ISR, consumed by eth_poll()
    volatile bool rx_pending;  // set by the ISR, consumed by eth_rx_process()
    eth_stats_t stats;
} eth_t;

eth_t eth_instance;

/* Descriptors and frame buffers. These live in .ethram, in the shared SRAM
 * region, because the Ethernet DMA -- like the USB DMA before it, which is why
 * .usbram exists -- cannot reach DTCM, where .bss and the GC heap are. Putting
 * them in .bss produces a MAC that initialises cleanly, reports link up, and
 * silently never receives a frame.
 *
 * .ethram is NOLOAD and outside .bss, so startup's _sbss.._ebss clear does not
 * cover it; eth_init() zeroes it explicitly. */
#define ETH_RAM_ATTR __attribute__((section(".ethram"), aligned(32)))

static ETH_DMADESCTypeDef eth_rx_desc[ETH_RX_DESC_NUM] ETH_RAM_ATTR;
static ETH_DMADESCTypeDef eth_tx_desc[ETH_TX_DESC_NUM] ETH_RAM_ATTR;
static uint8_t eth_rx_buf[ETH_RX_DESC_NUM][ETH_MAX_PACKET_SIZE] ETH_RAM_ATTR;
static uint8_t eth_tx_buf[ETH_TX_DESC_NUM][ETH_MAX_PACKET_SIZE] ETH_RAM_ATTR;

static ETH_DMADESCTypeDef *eth_rx_cur;
static ETH_DMADESCTypeDef *eth_tx_cur;

extern uint8_t _sethram, _eethram;

/******************************************************************************/
// Serialising lwip against the receive interrupt

/* The ETH interrupt calls into lwip (netif->input), and so does the periodic
 * timer sweep. Something has to keep those two out of each other's data
 * structures, because lwip in NO_SYS mode does no locking of its own.
 *
 * This masks ONLY the Ethernet interrupt, not all of them. A blanket
 * interrupt lock would also stall the UART, whose receive path has a single
 * hardware byte of slack at 115200 -- so protecting the network stack would
 * corrupt the console. Masking the one interrupt that can re-enter lwip is
 * both sufficient and free of that side effect.
 *
 * Used ONLY around code that cannot raise. See mpconfigport.h for why this is
 * deliberately not wired to LWIP_ENTER. */
static uint32_t eth_lock_depth;

void eth_lwip_lock(void) {
    if (eth_lock_depth++ == 0) {
        NVIC_DisableIRQ(ETH_IRQn);
    }
}

void eth_lwip_unlock(void) {
    if (eth_lock_depth > 0 && --eth_lock_depth == 0) {
        NVIC_EnableIRQ(ETH_IRQn);
    }
}

/******************************************************************************/
// PHY access

