Community-PIO-CH32V/ArduinoCore-CH32H4/libraries/lwIP_Ethernet/src/ch32h4_eth.c
uint16_t eth_phy_read(uint16_t reg) {
    return ETH_ReadPHYRegister(PHY_ADDRESS, reg);
}

void eth_phy_write(uint16_t reg, uint16_t val) {
    ETH_WritePHYRegister(PHY_ADDRESS, reg, val);
}

static uint16_t eth_phy_read_paged(uint16_t page, uint16_t reg) {
    eth_phy_write(PHY_PAG_SEL, page);
    uint16_t val = eth_phy_read(reg);
    eth_phy_write(PHY_PAG_SEL, PHY_PAGE_0);
    return val;
}

static void eth_phy_set_paged(uint16_t page, uint16_t reg, uint16_t bits) {
    eth_phy_write(PHY_PAG_SEL, page);
    eth_phy_write(reg, eth_phy_read(reg) | bits);
    eth_phy_write(PHY_PAG_SEL, PHY_PAGE_0);
}

/* Undocumented analog trim for the on-chip PHY, lifted verbatim from WCH's
 * PHY_PARA_CFG() macro in eth_driver.h. The address is inside the ETH block
 * (ETH_BASE is 0x40028000) but appears in no register map, and the triple
 * write of the same value is theirs, not a transcription error -- it reads
 * like a shift-register load that needs clocking through.
 *
 * WCH reapply it on every link-up rather than once at init. Doing the same,
 * because a trim that only mattered at init would not have been written that
 * way, and the cost is four stores. */
static void eth_phy_para_cfg(void) {
    volatile uint32_t *reg = (volatile uint32_t *)0x4002a00c;
    *reg = 0xfffff;
    *reg = 0xfffff;
    *reg = 0xfffff;
    *reg = 0xc2000;
}

/******************************************************************************/
// MAC bring-up

static void eth_get_mac_addr(uint8_t *out) {
    /* Stored high byte first, read downwards -- see ROM_CFG_USERADR_ID. */
    const uint8_t *src = (const uint8_t *)(ROM_CFG_USERADR_ID + 5);
    for (int i = 0; i < 6; i++) {
        out[i] = *src--;
    }
}

/* Drive the two Ethernet LEDs from the PHY rather than from software.
 *
 * Board wiring: ELED1 -> PF0 (green, link), ELED0 -> PF2 (yellow, activity),
 * each through a 0 ohm link. Both are AF10. Letting the PHY drive them gets
 * link and activity semantics -- including green being low-active -- for free
 * and costs no CPU time, which software blinking could not match. */
static void eth_led_init(void) {
    GPIO_InitTypeDef cfg;

    RCC_HB2PeriphClockCmd(RCC_HB2Periph_AFIO | RCC_HB2Periph_GPIOF, ENABLE);
    (void)RCC->HB2PCENR;  // RMW enable; read back or the first AF write is lost

    GPIO_PinAFConfig(GPIOF, GPIO_PinSource0, GPIO_AF10);
    GPIO_PinAFConfig(GPIOF, GPIO_PinSource2, GPIO_AF10);

    cfg.GPIO_Speed = GPIO_Speed_Very_High;
    cfg.GPIO_Mode = GPIO_Mode_AF_PP;
    cfg.GPIO_Pin = GPIO_Pin_0;
    GPIO_Init(GPIOF, &cfg);
    cfg.GPIO_Pin = GPIO_Pin_2;
    GPIO_Init(GPIOF, &cfg);

    // Enable the PHY's own LED driver.
    eth_phy_set_paged(PHY_PAGE_7, PHY_INTERRUPT_MASK, PHY_INTMASK_LED_ON);
}

static int eth_mac_init(eth_t *self) {
    // 1. Ethernet PLL.
    RCC->CTLR |= RCC_CTLR_ETH_PLLON;
    uint32_t deadline = millis() + 100;
    while ((RCC->CTLR & RCC_CTLR_ETH_PLLRDY) == 0) {
        if (millis() > deadline) {
            return -ETIMEDOUT;
        }
    }

    // 2. MAC clock. Read back: the enable is a read-modify-write, and without
    // this the first ETH register access is dropped.
    RCC->HBPCENR |= RCC_HBPCENR_ETHMACEN;
    (void)RCC->HBPCENR;

    // 3. Release the on-chip PHY: power it up, then take it out of reset.
    ETH->MACPHYCR &= ~MACPHYCR_PHY_POWERDOWN;
    ETH->MACPHYCR |= MACPHYCR_PHY_RESET_N;
    delay(1);

    // 4. Software reset of the MAC and DMA. Self-clearing.
    ETH_SoftwareReset();
    deadline = millis() + 100;
    while (ETH->DMABMR & ETH_DMABMR_SR) {
        if (millis() > deadline) {
            return -ETIMEDOUT;
        }
    }

    /* SMI clock divider. Must be set before any PHY access, and it is the
     * reason step 4 comes first: the software reset clears MACMIIAR. */
    ETH->MACMIIAR = ETH_MACMIIAR_CR_Div42;

    /* MAC configuration. Speed and duplex are deliberately absent here --
     * they are not known until auto-negotiation finishes, and eth_link_up()
     * writes them.
     *
     * Unlike WCH's driver this does NOT set promiscuous mode or receive-all.
     * They ship it that way because their stack filters in software; we have a
     * hardware perfect filter and a MAC address, so let the MAC drop what is
     * not ours instead of spending interrupt time on every frame on the
     * segment. Broadcast stays on, or ARP and DHCP would never arrive. */
    ETH->MACCR = ETH_Watchdog_Enable | ETH_Jabber_Enable
        | ETH_InterFrameGap_96Bit | ETH_ChecksumOffload_Disable
        | ETH_AutomaticPadCRCStrip_Disable | ETH_LoopbackMode_Disable;

    ETH->MACFFR = ETH_ReceiveAll_Disable | ETH_PromiscuousMode_Disable
        | ETH_BroadcastFramesReception_Enable
        | ETH_MulticastFramesFilter_Perfect
        | ETH_UnicastFramesFilter_Perfect
        | ETH_PassControlFrames_BlockAll
        | ETH_DestinationAddrFilter_Normal
        | ETH_SourceAddrFilter_Disable;

    ETH->MACHTHR = 0;
    ETH->MACHTLR = 0;
    ETH->MACFCR = ETH_UnicastPauseFrameDetect_Disable
        | ETH_ReceiveFlowControl_Disable | ETH_TransmitFlowControl_Disable;
    ETH->MACVLANTR = ETH_VLANTagComparison_16Bit;

    ETH->DMAOMR = ETH_DropTCPIPChecksumErrorFrame_Enable
        | ETH_TransmitStoreForward_Enable
        | ETH_ForwardErrorFrames_Disable
        | ETH_ForwardUndersizedGoodFrames_Disable;

    // 5. Programme our MAC address into the perfect filter.
    const uint8_t *mac = self->netif.hwaddr;
    ETH->MACA0HR = (uint32_t)((mac[5] << 8) | mac[4]);
    ETH->MACA0LR = (uint32_t)(mac[0] | (mac[1] << 8) | (mac[2] << 16) | (mac[3] << 24));

    /* Mask the MMC counter interrupts. These fire when a statistics counter
     * reaches half full and are latched until the counter is read; left
     * unmasked they eventually assert forever and the ETH interrupt never
     * stops firing. */
    ETH->MMCTIMR = ETH_MMCTIMR_TGFM;
    ETH->MMCRIMR = ETH_MMCRIMR_RGUFM | ETH_MMCRIMR_RFCEM;

    // 6. Descriptors.
    ETH_DMATxDescChainInit(eth_tx_desc, &eth_tx_buf[0][0], ETH_TX_DESC_NUM);
    ETH_DMARxDescChainInit(eth_rx_desc, &eth_rx_buf[0][0], ETH_RX_DESC_NUM);
    __asm volatile("fence" ::: "memory");
    eth_rx_cur = eth_rx_desc;
    eth_tx_cur = eth_tx_desc;

    /* 7. Interrupts. PHYSR is the CH32 addition: the on-chip PHY reports link
     * changes through the DMA status register, so there is no MDIO poll loop
     * here of the sort an external PHY would need. */
    ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_AIS | ETH_DMA_IT_R
        | ETH_DMA_IT_T | ETH_DMA_IT_RBU | ETH_DMA_IT_PHYSR, ENABLE);

