Community-PIO-CH32V/ArduinoCore-CH32H4/libraries/lwIP_Ethernet/src/ch32h4_eth.c
    // Ask the PHY to interrupt on link change, and clear anything latched.
    eth_phy_set_paged(PHY_PAGE_7, PHY_INTERRUPT_MASK, PHY_INTMASK_LINK_IE);
    (void)eth_phy_read(PHY_INTERRUPT_IND);

    return 0;
}

/******************************************************************************/
// Link handling

bool eth_link_is_up(eth_t *self) {
    return self->link_up;
}

/* Apply the negotiated speed and duplex to the MAC, then start it.
 *
 * Read from the PHY's vendor status register rather than deriving it from the
 * advertised/link-partner registers: the vendor register reports what the link
 * actually settled on, which is what the MAC has to match. */
static void eth_link_up(eth_t *self) {
    eth_phy_para_cfg();

    uint16_t status = eth_phy_read_paged(PHY_PAGE_0, PHY_STATUS_REG);

    uint32_t maccr = ETH->MACCR & ~(ETH_Speed_1000M | ETH_Mode_FullDuplex);
    maccr |= (status & PHY_STATUS_100M) ? ETH_Speed_100M : ETH_Speed_10M;
    if (status & PHY_STATUS_FULLDUP) {
        maccr |= ETH_Mode_FullDuplex;
    }
    ETH->MACCR = maccr;

    ETH_Start();

    self->link_up = true;
    self->stats.link_changes++;
    netif_set_link_up(&self->netif);
}

static void eth_link_down(eth_t *self) {
    self->link_up = false;
    self->stats.link_changes++;
    netif_set_link_down(&self->netif);

    /* Drop an address that DHCP gave us. Keeping it across a cable pull would
     * leave the interface claiming a lease that the server is free to hand to
     * someone else, so on reconnect we would be a duplicate. A statically
     * configured address is left alone -- the user set that deliberately. */
    struct netif *netif = &self->netif;
    if (netif_dhcp_data(netif) != NULL) {
        if (dhcp_supplied_address(netif)) {
            ip4_addr_set_zero(&netif->ip_addr);
        }
        dhcp_stop(netif);
    }
}

/* Start DHCP if the interface is up and has no address yet.
 *
 * This runs on every link-up rather than only from eth_start(), and that is
 * the whole point: after a reset, auto-negotiation is still in progress when
 * active(True) returns, so a DHCP attempt made there has no link to send on.
 * Starting it only at active(True) meant a board that had just been reset
 * never acquired an address, while one whose link was already up did -- which
 * is exactly as confusing to debug as it sounds. */
static void eth_dhcp_start_if_needed(eth_t *self) {
    struct netif *netif = &self->netif;
    if (!netif_is_up(netif) || !ip4_addr_isany_val(*netif_ip4_addr(netif))) {
        return;
    }
    /* Only start when DHCP is not already running. dhcp_start() is idempotent,
     * but a stop-then-start every poll cycle reset the state machine (and the
     * DISCOVER backoff) once a second, so a lease could never complete. */
    if (netif_dhcp_data(netif) == NULL) {
        dhcp_start(netif);
    }
}

/* Reconcile our idea of the link with the PHY's.
 *
 * Deliberately NOT called from the interrupt. It does half a dozen MDIO reads,
 * each of which is 64 bits clocked at HCLK/42 -- about 30 us apiece -- and on
 * link-up it goes on to allocate inside lwip via DHCP. Neither belongs in an
 * ISR, so the handler only sets link_event and this runs from eth_poll(). */
static void eth_link_poll(eth_t *self) {
    /* Read BSR twice. IEEE 802.3 defines the link status bit as latching low:
     * a single read reports "down" if the link dropped at any point since the
     * last read, even if it is up right now. Reading once makes a cable
     * replug look like a permanently dead link. */
    (void)eth_phy_read(PHY_BSR);
    uint16_t bsr = eth_phy_read(PHY_BSR);
    uint16_t bcr = eth_phy_read(PHY_BCR);

    bool up;
    if (!(bsr & PHY_Linked_Status)) {
        up = false;
    } else if (bcr & PHY_AutoNegotiation) {
        /* Link is electrically up but the MAC must not start until
         * auto-negotiation has settled, or it runs at the wrong duplex. The
         * PHY raises another interrupt when negotiation completes. */
        up = (bsr & PHY_AutoNego_Complete) != 0;
    } else {
        up = true;
    }

    if (up != self->link_up) {
        if (up) {
            eth_link_up(self);
        } else {
            eth_link_down(self);
        }
    }

    if (up && self->active) {
        eth_dhcp_start_if_needed(self);
    }

    // Clear the PHY's latched interrupt, or it never asserts again.
    eth_phy_write(PHY_PAG_SEL, PHY_PAGE_0);
    (void)eth_phy_read(PHY_INTERRUPT_IND);
}

/* Called from the port's background hook. Two jobs: pick up link changes the
 * interrupt flagged, and re-check the link periodically anyway.
 *
 * The periodic re-check is not redundant. Auto-negotiation completing does not
 * reliably raise a second PHY interrupt on this part, so a board reset with a
 * cable already attached can otherwise sit link-down forever, having missed
 * the one edge it was waiting for. One MDIO read per second costs nothing. */
void eth_poll(void) {
    eth_t *self = &eth_instance;
    if (self->netif.input == NULL) {
        return;  // never initialised
    }

    static uint32_t next_check_ms;
    uint32_t now = millis();
    bool due = (int32_t)(now - next_check_ms) >= 0;

    if (!self->link_event && !due) {
        return;
    }
    self->link_event = false;
    next_check_ms = now + 1000;

    eth_link_poll(self);
}

/******************************************************************************/
// Receive

static void eth_rx_frame(eth_t *self, const uint8_t *buf, size_t len) {
    struct netif *netif = &self->netif;

    /* Record which frame we are about to hand to lwIP, so a lockup anywhere in
     * the receive path still leaves the frame type readable by the V3F after
     * the reset. EtherType at bytes 12..13; for ARP the opcode at 20..21, for
     * IP the protocol at byte 23. */
    uint16_t ethertype = (len >= 14) ? (uint16_t)((buf[12] << 8) | buf[13]) : 0;
    uint8_t detail = 0;
    if (ethertype == 0x0806 && len >= 22) {
        detail = (uint8_t)((buf[20] << 8) | buf[21]);  /* 1=request 2=reply */
    } else if (ethertype == 0x0800 && len >= 24) {
        detail = buf[23];
    }
    ch32h4_eth_phase = 1;
    ch32h4_eth_last_frame = ((uint32_t)ethertype << 16)
                          | ((uint32_t)detail << 8)
                          | (len & 0xFFu);

    struct pbuf *p = pbuf_alloc(PBUF_RAW, len, PBUF_POOL);
    if (p == NULL) {
        self->stats.rx_dropped++;
        return;
    }

    /* Copy out of the DMA buffer rather than handing lwip a pointer into it.
     * The buffer has to stay in the shared region the DMA can reach, while
     * pbufs live in the fast DTCM heap; see the design doc for why that trade
     * is worth one memcpy at 259 MB/s against a 12.5 MB/s wire. */
    pbuf_take(p, buf, len);

    self->stats.rx_frames++;

    if (netif->input(p, netif) != ERR_OK) {
        pbuf_free(p);
        self->stats.rx_dropped++;
    }
}

/* Drain every descriptor the DMA has finished with.
 *
 * Runs in normal context from eth_rx_process(), NOT in the interrupt handler,
 * and that is the single most important structural decision in this driver.
 * netif->input() runs lwip's whole receive path -- ethernet_input, ip4_input,
 * tcp_input, and any callback the socket layer has registered -- which is a
 * deep call chain. Executing it on the interrupt stack, on top of whatever
 * depth the interrupted Python code had already reached, overflowed the stack
 * under sustained TCP load here: the board wedged mid-transfer and then reset
 * with no fault message, because the fault handler had no stack either.
 *
 * ports/stm32 does call input from its ISR and gets away with it. This port
 * has a 16 KB stack shared with the VM and no separate interrupt stack, so it
 * does not.
 *
 * The loop condition is OWN being clear, not the count of interrupts: one
 * receive interrupt can cover several frames, and stopping after one leaves
 * the rest sitting until the next frame arrives to nudge us. */
static void eth_rx_drain(eth_t *self) {
    while ((eth_rx_cur->Status & ETH_DMARxDesc_OWN) == 0) {
        uint32_t status = eth_rx_cur->Status;

        bool complete = (status & (ETH_DMARxDesc_FS | ETH_DMARxDesc_LS))
            == (ETH_DMARxDesc_FS | ETH_DMARxDesc_LS);

        if (complete && !(status & ETH_DMARxDesc_ES)) {
            /* Frame length includes the 4-byte CRC, which lwip must not see.
             * AutomaticPadCRCStrip is disabled, so it really is present. */
            size_t len = ((status & ETH_DMARxDesc_FL) >> 16);
            if (len >= 4 && len <= ETH_MAX_PACKET_SIZE) {
                eth_rx_frame(self, (const uint8_t *)eth_rx_cur->Buffer1Addr, len - 4);
            } else {
                self->stats.rx_dropped++;
            }
        } else {
            self->stats.rx_dropped++;
        }

        // Hand the descriptor back before moving on.
        eth_rx_cur->Status = ETH_DMARxDesc_OWN;
        __asm volatile("fence" ::: "memory");
        eth_rx_cur = (ETH_DMADESCTypeDef *)eth_rx_cur->Buffer2NextDescAddr;
        ch32h4_eth_phase = 4;
    }

    /* Demand-poll unconditionally. If the DMA suspended for want of a
     * descriptor while we were away, handing the descriptors back is not
     * enough to restart it -- it stays suspended until this register is
     * written, and the interface would go permanently deaf. */
    ETH->DMARPDR = 0;
}

/* Called from the background hook. Cheap when there is nothing to do: one read
 * of a flag the interrupt sets.
 *
 * The recursion guard is load-bearing, not belt-and-braces. This runs from the
 * hook that also fires every 256 bytecodes, and netif->input() below re-enters
 * the interpreter -- a socket callback scheduled by modlwip is enough. Without
 * the guard, that inner call walks the same eth_rx_cur the outer one is in the
 * middle of using: two loops advancing one shared ring pointer, handing the
 * same descriptor to lwip twice and skipping others. It corrupted memory after
 * roughly one lap of the ring, which is why a download died at the same byte
 * count every time and at any transfer rate.
 *
 * eth_lwip_lock() does not help here: it masks the Ethernet interrupt, and
 * this re-entry arrives from the same context, not from the interrupt. */
void eth_rx_process(void) {
    eth_t *self = &eth_instance;
    static bool in_rx;

    if (!self->rx_pending || in_rx) {
        return;
    }
    in_rx = true;
    self->rx_pending = false;
    eth_rx_drain(self);
    in_rx = false;
}

/******************************************************************************/
// Transmit

static err_t eth_netif_output(struct netif *netif, struct pbuf *p) {
    eth_t *self = netif->state;
    ch32h4_eth_phase = 2;

