Community-PIO-CH32V/ArduinoCore-CH32H4/libraries/lwIP_Ethernet/src/ch32h4_eth.c
    if (!self->link_up) {
        return ERR_IF;
    }
    if (p->tot_len > ETH_MAX_PACKET_SIZE) {
        return ERR_BUF;
    }

    /* A descriptor still owned by the DMA means all four are in flight. Wait
     * briefly rather than returning an error.
     *
     * Returning ERR_WOULDBLOCK here looks tidier and behaves badly: lwip drops
     * the segment and leaves recovery to the TCP retransmit timer, so a
     * momentary four-deep backlog costs an RTO -- and a bulk send refills the
     * queue immediately, so it happens again and the connection collapses to a
     * crawl and then stalls. That is exactly what a 256 KB upload did here.
     *
     * The bound is generous against the hardware it is waiting for: four
     * maximum-size frames take about 500 us to clear at 100 Mbit, so 5 ms is
     * an order of magnitude of headroom and still finite if the DMA has
     * genuinely wedged. */
    uint32_t deadline = millis() + 5;
    while (eth_tx_cur->Status & ETH_DMATxDesc_OWN) {
        if ((int32_t)(millis() - deadline) >= 0) {
            self->stats.tx_errors++;
            return ERR_IF;
        }
    }

    /* pbuf_copy_partial flattens the chain for us; a pbuf carrying a TCP
     * segment routinely arrives as header and payload in separate links. */
    uint8_t *buf = (uint8_t *)eth_tx_cur->Buffer1Addr;
    uint16_t len = pbuf_copy_partial(p, buf, p->tot_len, 0);
    if (len != p->tot_len) {
        self->stats.tx_errors++;
        return ERR_BUF;
    }

    ch32h4_eth_last_tx = p->tot_len;
    eth_tx_cur->ControlBufferSize = len & ETH_DMATxDesc_TBS1;
    eth_tx_cur->Status |= ETH_DMATxDesc_FS | ETH_DMATxDesc_LS | ETH_DMATxDesc_OWN;

    /* Make the descriptor writes visible to the DMA before kicking it: without
     * a fence the demand poll can run while OWN is still in the core's write
     * buffer, and the DMA reads a stale descriptor. */
    __asm volatile("fence" ::: "memory");

    /* Clear TBUS before poking the demand poll. If the DMA suspended for want
     * of a descriptor, the status bit is latched, and it will not resume while
     * the bit is still set. */
    ETH->DMASR = ETH_DMASR_TBUS;
    ETH->DMATPDR = 0;
    ch32h4_eth_phase = 3;

    self->stats.tx_frames++;
    eth_tx_cur = (ETH_DMADESCTypeDef *)eth_tx_cur->Buffer2NextDescAddr;

    return ERR_OK;
}

/******************************************************************************/
// Interrupt

/* The attribute belongs on the declaration -- see ch32h4_irq.h -- and it is
 * the same "WCH-Interrupt-fast" entry every other handler on this part uses.
 * A plain __attribute__((interrupt)) here would software-save the registers
 * the hardware stack has already saved: correct, but silently different from
 * every neighbouring handler for no stated reason. */
void CH32H4_IRQ_HANDLER(ETH_IRQHandler);
void ETH_IRQHandler(void) {
    ch32h4_irq_enter(&ch32h4_irq_eth_count);
    eth_irq_handler();
    ch32h4_eth_phase = 6;
    ch32h4_irq_exit();
    ch32h4_eth_phase = 7;
}

void eth_irq_handler(void) {
    eth_t *self = &eth_instance;
    ch32h4_eth_phase = 5;
    uint32_t status = ETH->DMASR;

    /* This handler does no work beyond acknowledging the hardware and setting
     * two flags. Everything with a call chain behind it -- frame processing,
     * PHY reads, DHCP -- happens in the background hook instead. See the
     * comment on eth_rx_drain() for what putting it here cost. */
    if (status & ETH_DMASR_NIS) {
        if (status & ETH_DMASR_RS) {
            ETH->DMASR = ETH_DMASR_RS;
            self->rx_pending = true;
        }
        if (status & ETH_DMASR_TS) {
            ETH->DMASR = ETH_DMASR_TS;
        }
        if (status & ETH_DMA_FLAG_PHYSR) {
            ETH->DMASR = ETH_DMA_FLAG_PHYSR;
            self->link_event = true;
        }
        ETH->DMASR = ETH_DMASR_NIS;
    }

    if (status & ETH_DMASR_AIS) {
        if (status & ETH_DMASR_RBUS) {
            // We did not drain fast enough; eth_rx_drain() restarts the DMA.
            self->stats.rx_buf_unavail++;
            ETH->DMASR = ETH_DMASR_RBUS;
            self->rx_pending = true;
        }
        ETH->DMASR = ETH_DMASR_AIS;
    }
}

/******************************************************************************/
// lwip glue

static err_t eth_netif_init(struct netif *netif) {
    netif->linkoutput = eth_netif_output;
    netif->output = etharp_output;
    netif->mtu = 1500;
    netif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP
        | NETIF_FLAG_ETHERNET | NETIF_FLAG_IGMP;
    netif->name[0] = 'e';
    netif->name[1] = '0';
    return ERR_OK;
}

/******************************************************************************/
// Public interface

int eth_init(eth_t *self) {
    if (self->netif.input != NULL) {
        return 0;  // already initialised
    }

    /* .ethram is NOLOAD and outside .bss, so nothing has cleared it. Do it
     * here, exactly as ch32_usbd_init() does for .usbram -- a descriptor whose
     * OWN bit starts as whatever the RAM held is a very confusing bug. */
    memset(&_sethram, 0, (size_t)(&_eethram - &_sethram));

    memset(&self->stats, 0, sizeof(self->stats));
    self->active = false;
    self->link_up = false;

    eth_get_mac_addr(self->netif.hwaddr);
    self->netif.hwaddr_len = 6;

    int ret = eth_mac_init(self);
    if (ret != 0) {
        return ret;
    }

    eth_led_init();

    ip_addr_t none = { 0 };
    netif_add(&self->netif, &none, &none, &none, self,
        eth_netif_init, ethernet_input);
    /* The DHCP hostname. A sketch changes it with eth_set_hostname() before
     * eth_init(); the default is what shows up in a router's client list. */
    netif_set_hostname(&self->netif, ch32h4_eth_hostname);
    netif_set_default(&self->netif);

    NVIC_SetPriority(ETH_IRQn, 1);
    NVIC_EnableIRQ(ETH_IRQn);

    return 0;
}

int eth_start(eth_t *self) {
    int ret = eth_init(self);
    if (ret != 0) {
        return ret;
    }

    self->active = true;
    netif_set_up(&self->netif);

    /* Pick up a cable that was already plugged in before we enabled the
     * interrupt: with no link change to report, the PHY has nothing to
     * interrupt about. If negotiation has not finished yet this finds the link
     * still down, and eth_poll() picks it up a second later -- which is why
     * DHCP is started from eth_link_poll() rather than here. */
    eth_link_poll(self);

