Community-PIO-CH32V/ArduinoCore-CH32H4/libraries/lwIP_Ethernet/src/ch32h4_eth.c
    return 0;
}

int eth_stop(eth_t *self) {
    if (!self->active) {
        return 0;
    }

    dhcp_stop(&self->netif);
    netif_set_down(&self->netif);

    ETH_MACTransmissionCmd(DISABLE);
    ETH_MACReceptionCmd(DISABLE);
    ETH_FlushTransmitFIFO();
    ETH_DMATransmissionCmd(DISABLE);
    ETH_DMAReceptionCmd(DISABLE);

    self->active = false;
    return 0;
}

bool eth_is_active(eth_t *self) {
    return self->active;
}

struct netif *eth_netif(eth_t *self) {
    return &self->netif;
}

const eth_stats_t *eth_get_stats(eth_t *self) {
    return &self->stats;
}

/* Reads clocks, MAC and PHY in one pass, so ch32.eth_diag() can say which
 * stage of bring-up failed rather than only that the link is down. Safe to
 * call before eth_init(): the register reads return zeros, which is itself the
 * answer. */
void eth_get_diag(eth_diag_t *out) {
    out->rcc_ctlr = RCC->CTLR;
    out->hbpcenr = RCC->HBPCENR;
    out->macphycr = ETH->MACPHYCR;
    out->maccr = ETH->MACCR;
    out->dmasr = ETH->DMASR;
    out->dmaomr = ETH->DMAOMR;

    out->phy_id1 = eth_phy_read(PHY_PHYIDR1);
    out->phy_id2 = eth_phy_read(PHY_PHYIDR2);
    out->phy_bcr = eth_phy_read(PHY_BCR);
    (void)eth_phy_read(PHY_BSR);  // latched-low; see eth_link_poll()
    out->phy_bsr = eth_phy_read(PHY_BSR);
    out->phy_anlpar = eth_phy_read(PHY_ANLPAR);
    out->phy_status = eth_phy_read_paged(PHY_PAGE_0, PHY_STATUS_REG);

    out->lock_depth = eth_lock_depth;
    out->irq_enabled = NVIC_GetStatusIRQ(ETH_IRQn) ? 1 : 0;
}

/* Encoding is the one network.LAN.status() uses across ports, from
 * ports/stm32/eth.c: 0 no link, 1 link but interface down, 2 link but no IP
 * yet, 3 fully up. */
int eth_link_status(eth_t *self) {
    struct netif *netif = &self->netif;
    if ((netif->flags & (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP))
        == (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP)) {
        return netif_ip4_addr(netif)->addr != 0 ? 3 : 2;
    }
    return self->link_up ? 1 : 0;
}
